**Analisi dei dati anagrafici dei dipendenti di un'azienda**

In [1]:
import pandas as pd
import numpy as np

1. Inserisci in un dataframe il contenuto del file "dipendenti.csv".

   Quante righe e quante colonne ci sono?

In [62]:
df = pd.read_csv('../data/dipendenti.csv', sep=';')
n_columns = len(df.columns)
n_rows = len(df.index)
print(f"rows: {n_rows} columns: {n_columns}")

rows: 15 columns: 7

2. Crea una nuova colonna chiamata **Livello Esperienza**, utilizzando la colonna **Anni di esperienza**. Se l'esperienza è minore di 5 anni, mappa il valore a "Junior", tra 5 e 10 a "Mid" e più di 10 a "Senior".

In [25]:
df['Livello Esperienza'] = pd.cut(df['Anni di esperienza'], (0, 5, 10, np.inf), labels=['Junior', 'Mid', 'Senior'])
df.head()

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città,Livello Esperienza
0,Marco,Rossi,NaN,2,Vendite,30000,Milano,Junior
1,Anna,Bianchi,32.0,7,Information Technology,45000,Roma,Mid
2,Luca,Verdi,28.0,5,Vendite,37000,Milano,Junior
3,Sara,Neri,40.0,12,Information Technology,62000,Roma,Senior
4,Giorgio,Rossi,45.0,20,Human Resources,70000,Torino,Senior

3. Sostituisci i nomi dei dipartimenti con le seguenti abbreviazioni: Vendite -> 'VEN', Information Technology -> 'IT', Human Resources -> 'HR'.

In [26]:
abbr_map = {'Vendite': 'VEN', 'Information Technology': 'IT', 'Human Resources': 'HR'}
df['Dipartimento'] = df['Dipartimento'].map(abbr_map)
df.head()

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città,Livello Esperienza
0,Marco,Rossi,NaN,2,VEN,30000,Milano,Junior
1,Anna,Bianchi,32.0,7,IT,45000,Roma,Mid
2,Luca,Verdi,28.0,5,VEN,37000,Milano,Junior
3,Sara,Neri,40.0,12,IT,62000,Roma,Senior
4,Giorgio,Rossi,45.0,20,HR,70000,Torino,Senior

4. Crea un'altra colonna con i valori di età discretizzati in 5 gruppi, a quale gruppo di età appartiene la maggior parte dei dipendenti?

In [27]:
df['Età bin'] = pd.cut(df['Età'], bins=5)
df['Età bin'].value_counts()

Età bin
(27.983, 31.4]    5
(31.4, 34.8]      5
(41.6, 45.0]      2
(38.2, 41.6]      1
(34.8, 38.2]      0
Name: count, dtype: int64

5. Sostituisci i valori mancanti della colonna età con il valore medio di età per i dipendenti dello stesso settore.

In [50]:
mean_series = df.groupby(['Dipartimento'])['Età'].transform('mean')
df['Età'] = df['Età'].fillna(mean_series)
df.head()

,Nome,Cognome,Età,Anni di esperienza,Dipartimento,Stipendio,Città,Livello Esperienza,Età bin
0,Marco,Rossi,30.285714,2,VEN,30000,Milano,Junior,NaN
1,Anna,Bianchi,32.000000,7,IT,45000,Roma,Mid,"(31.4, 34.8]"
2,Luca,Verdi,28.000000,5,VEN,37000,Milano,Junior,"(27.983, 31.4]"
3,Sara,Neri,40.000000,12,IT,62000,Roma,Senior,"(38.2, 41.6]"
4,Giorgio,Rossi,45.000000,20,HR,70000,Torino,Senior,"(41.6, 45.0]"

In [ ]:
mean_s = df.groupby(['Dipartimento'])['Età'].transform(lambda g : g.mean())

0     30.285714
1     34.750000
2     30.285714
3     34.750000
4     45.000000
5     45.000000
6     34.750000
7     30.285714
8     30.285714
9     45.000000
10    30.285714
11    30.285714
12    34.750000
13    30.285714
14    30.285714
Name: Età, dtype: float64

6. Verifica se, in media, lo stipendio di chi vive a Milano è superiore rispetto a quello di chi vive a Roma.

In [ ]:
city_dict = df.groupby(['Città'])['Stipendio'].mean().to_dict()
city_dict['Milano'] > city_dict['Roma']

False